Tauser/noisebot/sdkconfig.defaults
# NoiseBot sdkconfig.defaults
# Gerado para: Freenove ESP32-S3-WROOM CAM N16R8 (16MB Flash, 8MB PSRAM Octal)

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# --- Partition table personalizada ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (Octal SPI 8MB) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Alocacoes menores que 16KB vao para SRAM interna (DMA buffers, stacks)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

# --- Brownout (nivel 7 = ~2.97V) ---
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# --- Task Watchdog ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# --- Stack overflow (modo canary: deteccao sem custo de perda de contexto) ---
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Unicore=n: usar dual-core (Core0=WiFi/BT, Core1=app)
CONFIG_FREERTOS_UNICORE=n

# --- Main task stack ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y
# Timestamps em microsegundos para debug de timing
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# --- NVS ---
CONFIG_NVS_ENCRYPTION=n

# --- USB Serial (debug via USB-JTAG do ESP32-S3) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- WiFi / BT (desabilitados na fase inicial) ---
# Habilitar quando necessario — afeta Core0
CONFIG_ESP_WIFI_ENABLED=n

# --- Compiler ---
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=n
